TestCases/fixedHumidityBC/0/nut
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      nut;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -1 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    earth
    {
        type            atmNutkWallFunction; // WMLES
        kappa           0.41;
        Cmu             0.09;
        // z0              uniform 0.0002; // Calm open sea
        // z0              uniform 0.03; // Open flat terrain, grass
        z0              uniform 0.075; // z0m=0.075 in [boundary] in clear_sky.ini file
        // z0              uniform 0.25; // High crops, many trees
        // z0              uniform 1.0; // Suburb, forest
        // z0              uniform 2.0; // City centre with high‐ and low‐rise buildings, very hilly or moderate mountainous area.
        value           uniform 0.0;
    }
	cblTop
    {
        type            calculated;
        value           uniform 0;
    }
    
    // LEFT-RIGHT SIDES:
    cblLeft
    {
        type            cyclic;
    }
    cblRight
    {
        type            cyclic;
    }
    
    // FRONT-BACK SIDES if 3D:
    cblFront
    {
        type            cyclic;
    }

    cblBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
