TestCases/fixedHumidityBC/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  plus                                  |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 0;

boundaryField
{
    earth
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
	cblTop
    {
        type            fixedFluxPressure;
        rho             rhok;
        value           uniform 0;
    }
    
    // LEFT-RIGHT SIDES:
    cblLeft
    {
        type            cyclic;
    }
    cblRight
    {
        type            cyclic;
    }
    
    // FRONT-BACK SIDES if 3D:
    cblFront
    {
        type            cyclic;
    }

    cblBack
    {
        type            cyclic;
    }
}


// ************************************************************************* //
